#Если на часах 8 или меньше, то Коля успеет к уроку химии. Если больше 8 часов, то Колю съест Тригубчак.

#Рассмотрим три случайных события:

#Первое:
a = 10 #время на часах Коли
if a < 8:
  print("Коля успевает!")
elif a == 8:
  print("Коля успевает!")
else:
  print("Помянем..")

#Второе:
a = 7 #время на часах Коли
if a < 8:
  print("Коля успевает!")
elif a == 8:
  print("Коля успевает!")
else:
  print("Помянем..")

#Третье:
a = 8
if a < 8:
  print("Коля успевает!")
elif a == 8:
  print("Коля успевает!")
else:
  print("Помянем..")
